[

        {

          "Review_text": "Connection Success! Our virtual date felt like exploring a new branch in a repository. We discussed our favorite sci-fi movies and shared GitHub repositories. The chemistry between us was undeniable, leaving me eager for our next commit to this connection!",
          "badge": "200",
          "review_id": 1
        
      
        },
      
      
        {

          "Review_text": "Our date was like trying to merge code with conflicting changes .. bit of a challenge, like facing merge conflicts without a resolution. Maybe next time, we'll find a smoother way to collaborate.",
          "badge": "400",
          "review_id": 2
        

        },


        {

          "Review_text": "No Content: The best way to explain this .... like trying to find a rare Pokémon, that always gets away.",
          "badge": "204",
          "review_id": 3
         

        },


        {

          "Review_text": "Unauthorized: Our conversation felt as secure as an open-source project on GitHub. Have you ever tried to access a restricted API without proper authentication?",
          "badge": "401",
          "review_id": 6
        

        },


        {

          "Review_text": "Not Acceptable: Our conversation had more syntax errors than a coder's first 'Hello World' program.",
          "badge": "406",
          "review_id": 8
         

        },


        {

          "Review_text": "Gateway Timeout: Our connection was slower than my grandma's internet, felt like I was stuck in a never-ending loop.",
          "badge": "504",
          "review_id": 9
         

        },


        {

          "Review_text": "Service Unavaiable: Date ghosted me, left me wondering if I had been 404'd. Maybe our love story needed better error handling.",
          "badge": "503",
          "review_id": 10
         

        },


        {

          "Review_text": "Unavaiable for legal reasons: Our date was going great until they got arrested for 'Binary Burglary'! Yes, you heard it right. They were caught trying to steal ones and zeroes from a top-secret computer. Imagine this .. were having dinner when programmers in uniforms rushed in. My date tried to run, but they were caught quickly. The restaurant even played 'error sounds' as they were taken away.",
          "badge": "451",
          "review_id": 12
         

        },


        {

          "Review_text": "Expectation Failed: I expected fireworks, but it was more like a quiet night in. It was as disappointing as waiting for your crush to respond to your DMs. Maybe we needed better async communication",
          "badge": "417",
          "review_id": 13
        

        },


        {

          "Review_text": "Forbidden: Forbidden Fun! We explored an abandoned data center together, decoding error messages and sharing a daring kiss amidst dusty server racks. It was an electrifying experience, filled with adrenaline and undeniable chemistry. A date filled with forbidden fun and unforgettable moments!",
          "badge": "403",
          "review_id": 14
         

        },



        {

          "Review_text": "Payment Required: It felt like a date that required a hefty payment, and not just for dinner. When the bill arrived, I said, 'This must be the cost of code!' My date chuckled and replied, 'It's a small price to pay for compatibility.' A date worth its weight in code, just remember to bring your wallet.",
          "badge": "402",
          "review_id": 16

        },


        {

          "Review_text": "Conflict: We did not get off on the right foot at first .. an epic battle between JavaScript and Python! Our encounter turned into a hilarious showdown, as two passionate tech enthusiasts couldn't agree on which programming language reigns SUPREME! Despite conflicting opinions, we bonded over our shared love for coding.",
          "badge": "409",
          "review_id": 3
        

        }
      
      ]
      